francescopace/micropython-esp32-csi/ports/esp32/modwifi_csi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Francesco Pace <francesco.pace@gmail.com>
 * Copyright (c) 2025 MicroPython CSI Module Contributors
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/mphal.h"
#include "py/objarray.h"
#include "py/runtime.h"

#if MICROPY_PY_NETWORK_WLAN_CSI

#include "esp_log.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "modwifi_csi.h"
#include <string.h>

static const char *TAG = "wifi_csi";

// Global CSI state (static - only used within this file)
static csi_state_t g_csi_state = {
    .buffer =
    {
        .frames = NULL,
        .head = 0,
        .tail = 0,
        .size = 0,
        .dropped = 0,
        .initialized = false,
    },
    .config =
    {
        .lltf_en = true,
        .htltf_en = true,
        .stbc_htltf2_en = true,
        .ltf_merge_en = true,
        .channel_filter_en = false,
        .manu_scale = false,
        .shift = 0,
        .buffer_size = MICROPY_PY_NETWORK_WLAN_CSI_DEFAULT_BUFFER_SIZE,
    },
    .enabled = false,
};

// ============================================================================
// Circular Buffer Implementation (Lock-Free)
// ============================================================================

static bool csi_buffer_init(csi_buffer_t *buf, uint32_t size) {
    if (buf->initialized) {
        // Already initialized, free old buffer
        if (buf->frames) {
            heap_caps_free(buf->frames);
        }
    }

    // Allocate from internal RAM that's accessible from ISR context
    // Buffer must be accessible from IRAM_ATTR callback (wifi_csi_rx_cb)
    buf->frames = (csi_frame_t *)heap_caps_malloc(sizeof(csi_frame_t) * size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (buf->frames == NULL) {
        ESP_LOGE(TAG, "Failed to allocate CSI buffer");
        return false;
    }

    buf->size = size;
    buf->head = 0;
    buf->tail = 0;
    buf->dropped = 0;
    buf->initialized = true;

    ESP_LOGI(TAG, "CSI buffer initialized: %lu frames", (unsigned long)size);
    return true;
}

static void csi_buffer_deinit(csi_buffer_t *buf) {
    if (buf->initialized && buf->frames) {
        heap_caps_free(buf->frames);
        buf->frames = NULL;
        buf->initialized = false;
        buf->dropped = 0; // Reset dropped counter for clean state
    }
}

static bool csi_buffer_is_empty(const csi_buffer_t *buf) {
    return buf->head == buf->tail;
}

// Called from ISR context - must be fast and non-blocking
static bool csi_buffer_write(csi_buffer_t *buf, const csi_frame_t *frame) {
    if (!buf->initialized) {
        return false;
    }

    uint32_t next_head = (buf->head + 1) % buf->size;

    if (next_head == buf->tail) {
        // Buffer full, drop frame
        buf->dropped++;
        return false;
    }

    // Copy frame data
    memcpy(&buf->frames[buf->head], frame, sizeof(csi_frame_t));

    // Update head (atomic on ESP32)
    buf->head = next_head;

    return true;
}

// Called from Python context
static bool csi_buffer_read(csi_buffer_t *buf, csi_frame_t *frame) {
    if (!buf->initialized || csi_buffer_is_empty(buf)) {
        return false;
    }

    // Copy frame data
    memcpy(frame, &buf->frames[buf->tail], sizeof(csi_frame_t));

    // Update tail
    buf->tail = (buf->tail + 1) % buf->size;

    return true;
}

// ============================================================================
// CSI Callback (ISR Context)
// ============================================================================

void IRAM_ATTR wifi_csi_rx_cb(void *ctx, wifi_csi_info_t *info) {
    if (!g_csi_state.enabled || !g_csi_state.buffer.initialized) {
        return;
    }

    csi_frame_t frame;

    // Extract metadata
    // Note: ESP32-C5 and ESP32-C6 have a different rx_ctrl structure with fewer
    // fields
    frame.rssi = info->rx_ctrl.rssi;
    frame.rate = info->rx_ctrl.rate;

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5/C6: Many fields are not available in esp_wifi_rxctrl_t
    // Initialize all fields to zero, then assign available ones
    memset(&frame, 0, sizeof(csi_frame_t));
    // Fields not available in C5/C6 rx_ctrl are already zero from memset above
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3: Full rx_ctrl structure available
    frame.sig_mode = info->rx_ctrl.sig_mode;
    frame.mcs = info->rx_ctrl.mcs;
    frame.cwb = info->rx_ctrl.cwb;
    frame.smoothing = info->rx_ctrl.smoothing;
    frame.not_sounding = info->rx_ctrl.not_sounding;
    frame.aggregation = info->rx_ctrl.aggregation;
    frame.stbc = info->rx_ctrl.stbc;
    frame.fec_coding = info->rx_ctrl.fec_coding;
    frame.sgi = info->rx_ctrl.sgi;
    frame.ampdu_cnt = info->rx_ctrl.ampdu_cnt;
    frame.secondary_channel = info->rx_ctrl.secondary_channel;
    frame.ant = info->rx_ctrl.ant;
    #endif

    // Common fields available on all targets
    frame.noise_floor = info->rx_ctrl.noise_floor;
    frame.channel = info->rx_ctrl.channel;
    frame.local_timestamp = info->rx_ctrl.timestamp;
    frame.sig_len = info->rx_ctrl.sig_len;
    frame.rx_state = info->rx_ctrl.rx_state;

    // Copy MAC address
    memcpy(frame.mac, info->mac, 6);

    // Get timestamp
    frame.timestamp_us = (uint32_t)esp_timer_get_time();

