francescopace/micropython-esp32-csi/ports/esp32/modwifi_csi.c
        .acquire_csi_legacy =
            1, // Acquire L-LTF CSI from legacy 802.11a/g packets
               // CRITICAL: Required for CSI callback to be invoked!

        .acquire_csi_ht20 = 1, // Acquire HT-LTF CSI from 802.11n HT20 packets
                               // CRITICAL: Required for CSI from HT packets!

        .acquire_csi_ht40 =
            0, // Acquire HT-LTF CSI from 802.11n HT40 packets (40MHz bandwidth)
               // Disabled (using HT20 for stability)

        .acquire_csi_su = 1, // Acquire HE-LTF CSI from 802.11ax HE20 SU
                             // (Single-User) packets Enabled for WiFi 6 support

        .acquire_csi_mu =
            0, // Acquire HE-LTF CSI from 802.11ax HE20 MU (Multi-User) packets
               // Disabled (not using WiFi 6 MU-MIMO)

        .acquire_csi_dcm = 0, // Acquire CSI from DCM (Dual Carrier Modulation)
                              // packets Disabled (not commonly used)

        .acquire_csi_beamformed =
            0, // Acquire CSI from beamformed packets
               // Disabled (not needed for general CSI capture)

        // Note: acquire_csi_he_stbc field not available on ESP32-C5

        .val_scale_cfg = 0, // CSI value scaling configuration (0-8)
                            // 0 = automatic scaling (recommended)

        .dump_ack_en = 0, // Enable capture of 802.11 ACK frames
                          // Disabled to reduce overhead
    };
    #else
    // ESP32, ESP32-S2, ESP32-S3, ESP32-C3 use legacy CSI API with LTF fields
    wifi_csi_config_t csi_config = {
        .lltf_en =
            g_csi_state.config
            .lltf_en,   // Enable Legacy Long Training Field (L-LTF) CSI capture
                        // L-LTF is present in all 802.11a/g packets
                        // Provides base channel estimation (64 subcarriers)

        .htltf_en =
            g_csi_state.config
            .htltf_en,   // Enable HT Long Training Field (HT-LTF) CSI capture
                         // HT-LTF is present in 802.11n (HT) packets
                         // Provides improved channel estimation for MIMO

        .stbc_htltf2_en =
            g_csi_state.config
            .stbc_htltf2_en,   // Enable Space-Time Block Code HT-LTF2 capture
                               // STBC uses 2 antennas to improve reliability
                               // Captures second HT-LTF when STBC is active

        .ltf_merge_en =
            g_csi_state.config
            .ltf_merge_en,   // Merge L-LTF and HT-LTF data by averaging
                             // true: Average L-LTF and HT-LTF for HT packets
                             // (more stable) false: Use only HT-LTF for HT
                             // packets (more precise)

        .channel_filter_en =
            g_csi_state.config
            .channel_filter_en,   // Channel filter to smooth adjacent
                                  // subcarriers true: Filter/smooth adjacent
                                  // subcarriers (52 useful) false: Keep
                                  // subcarrier independence (64 total)

        .manu_scale =
            g_csi_state.config.manu_scale, // Manual vs automatic CSI data scaling
                                           // false: Auto-scaling (recommended,
                                           // adapts dynamically) true: Manual
                                           // scaling (requires .shift parameter)

        .shift =
            g_csi_state.config.shift, // Shift value for manual scaling (0-15)
                                      // Only used when manu_scale = true

        .dump_ack_en = false, // Enable capture of 802.11 ACK frames
                              // Disabled to reduce overhead
    };
    #endif

    ESP_LOGI(TAG, "Setting CSI config...");
    ret = esp_wifi_set_csi_config(&csi_config);
    ESP_LOGD(TAG, "esp_wifi_set_csi_config returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set CSI config: 0x%x", ret);
        return ret;
    }

    ESP_LOGI(TAG, "Registering CSI callback...");
    ret = esp_wifi_set_csi_rx_cb(wifi_csi_rx_cb, NULL);
    ESP_LOGD(TAG, "esp_wifi_set_csi_rx_cb returned: 0x%x", ret);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register callback: 0x%x", ret);
        return ret;
    }

    // Enable CSI LAST
    ESP_LOGI(TAG, "Calling esp_wifi_set_csi(true)...");
    ret = esp_wifi_set_csi(true);
    ESP_LOGD(TAG, "esp_wifi_set_csi returned: 0x%x (ESP_OK=0x%x)", ret, ESP_OK);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable CSI (error code: 0x%x)", ret);
        ESP_LOGE(TAG, "Common causes:");
        ESP_LOGE(TAG, "  - WiFi not connected");
        ESP_LOGE(TAG, "  - CSI config invalid");
        ESP_LOGE(TAG, "  - Hardware limitation");
        return ret;
    }

    g_csi_state.enabled = true;

    #if CONFIG_IDF_TARGET_ESP32C6
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C6 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32C5
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C5 mode - WiFi 6 support)");
    #elif CONFIG_IDF_TARGET_ESP32S3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S3 mode)");
    #elif CONFIG_IDF_TARGET_ESP32S2
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-S2 mode)");
    #elif CONFIG_IDF_TARGET_ESP32C3
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32-C3 mode)");
    #else
    ESP_LOGI(TAG, "CSI enabled successfully (ESP32 mode)");
    #endif

    return ESP_OK;
}

static esp_err_t wifi_csi_disable(void) {
    if (!g_csi_state.enabled) {
        return ESP_OK;
    }

    esp_err_t ret = esp_wifi_set_csi(false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to disable CSI: %d", ret);
        return ret;
    }

    // Clean up: deallocate buffer and reset config to defaults
    csi_buffer_deinit(&g_csi_state.buffer);

    // Reset config to defaults
    g_csi_state.config.lltf_en = true;
    g_csi_state.config.htltf_en = true;
    g_csi_state.config.stbc_htltf2_en = true;
    g_csi_state.config.ltf_merge_en = true;
    g_csi_state.config.channel_filter_en = true;
    g_csi_state.config.manu_scale = false;
    g_csi_state.config.shift = 0;
    g_csi_state.config.buffer_size = MICROPY_PY_NETWORK_WLAN_CSI_DEFAULT_BUFFER_SIZE;

