francescopace/micropython-esp32-csi/ports/esp32/modwifi_csi.c
    g_csi_state.enabled = false;
    ESP_LOGI(TAG, "CSI disabled and state cleaned");
    return ESP_OK;
}

static bool wifi_csi_read_frame(csi_frame_t *frame) {
    return csi_buffer_read(&g_csi_state.buffer, frame);
}

// ============================================================================
// MicroPython Bindings
// ============================================================================

// wlan.csi_enable(**kwargs)
static mp_obj_t network_wlan_csi_enable(size_t n_args, const mp_obj_t *args,
    mp_map_t *kw_args) {
    (void)args[0]; // WLAN object not used, CSI is global state

    enum {
        ARG_lltf_en,
        ARG_htltf_en,
        ARG_stbc_htltf2_en,
        ARG_ltf_merge_en,
        ARG_channel_filter_en,
        ARG_manu_scale,
        ARG_shift,
        ARG_buffer_size
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_lltf_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},
        {MP_QSTR_htltf_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},
        {MP_QSTR_stbc_htltf2_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},
        {MP_QSTR_ltf_merge_en, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = true}},
        {MP_QSTR_channel_filter_en,
         MP_ARG_KW_ONLY | MP_ARG_BOOL,
         {.u_bool = true}},
        {MP_QSTR_manu_scale, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false}},
        {MP_QSTR_shift, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0}},
        {MP_QSTR_buffer_size,
         MP_ARG_KW_ONLY | MP_ARG_INT,
         {.u_int = MICROPY_PY_NETWORK_WLAN_CSI_DEFAULT_BUFFER_SIZE}},
    };

    mp_arg_val_t parsed_args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, args + 1, kw_args, MP_ARRAY_SIZE(allowed_args),
        allowed_args, parsed_args);

    // Update configuration with provided parameters
    g_csi_state.config.lltf_en = parsed_args[ARG_lltf_en].u_bool;
    g_csi_state.config.htltf_en = parsed_args[ARG_htltf_en].u_bool;
    g_csi_state.config.stbc_htltf2_en = parsed_args[ARG_stbc_htltf2_en].u_bool;
    g_csi_state.config.ltf_merge_en = parsed_args[ARG_ltf_merge_en].u_bool;
    g_csi_state.config.channel_filter_en =
        parsed_args[ARG_channel_filter_en].u_bool;
    g_csi_state.config.manu_scale = parsed_args[ARG_manu_scale].u_bool;
    g_csi_state.config.shift =
        parsed_args[ARG_shift].u_int & 0x0F; // Limit to 0-15
    g_csi_state.config.buffer_size = parsed_args[ARG_buffer_size].u_int;

    if (g_csi_state.config.buffer_size < 1 ||
        g_csi_state.config.buffer_size > 1024) {
        mp_raise_ValueError(
            MP_ERROR_TEXT("buffer_size must be between 1 and 1024"));
    }

    // Enable CSI with the configuration
    esp_err_t ret = wifi_csi_enable();
    if (ret != ESP_OK) {
        mp_raise_OSError(ret);
    }

    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_csi_enable_obj, 1,
    network_wlan_csi_enable);

// wlan.csi_disable()
static mp_obj_t network_wlan_csi_disable(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state
    esp_err_t ret = wifi_csi_disable();
    if (ret != ESP_OK) {
        mp_raise_OSError(ret);
    }
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_disable_obj,
    network_wlan_csi_disable);

// wlan.csi_read() -> tuple or None
// Returns tuple: (rssi, channel, mac, timestamp, local_timestamp, data, rate, sig_mode,
//                 mcs, cwb, smoothing, not_sounding, aggregation, stbc, fec_coding, sgi,
//                 noise_floor, ampdu_cnt, secondary_channel, ant, sig_len, rx_state)
static mp_obj_t network_wlan_csi_read(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state

    csi_frame_t frame;

    if (!wifi_csi_read_frame(&frame)) {
        return mp_const_none;
    }

    // Create tuple with frame data (order: most important fields first)
    // Tuple order matches logical importance: rssi, channel, mac, timestamps, data, then metadata
    mp_obj_t items[22];

    items[0] = mp_obj_new_int(frame.rssi);
    items[1] = mp_obj_new_int(frame.channel);
    items[2] = mp_obj_new_bytes(frame.mac, 6);
    items[3] = mp_obj_new_int(frame.timestamp_us);
    items[4] = mp_obj_new_int(frame.local_timestamp);

    // CSI data as array('b') - int8_t values matching ESP-IDF API
    mp_obj_array_t *csi_array =
        MP_OBJ_TO_PTR(mp_obj_new_bytearray_by_ref(frame.len, frame.data));
    csi_array->typecode = 'b';
    items[5] = MP_OBJ_FROM_PTR(csi_array);

    // Metadata fields
    items[6] = mp_obj_new_int(frame.rate);
    items[7] = mp_obj_new_int(frame.sig_mode);
    items[8] = mp_obj_new_int(frame.mcs);
    items[9] = mp_obj_new_int(frame.cwb);
    items[10] = mp_obj_new_int(frame.smoothing);
    items[11] = mp_obj_new_int(frame.not_sounding);
    items[12] = mp_obj_new_int(frame.aggregation);
    items[13] = mp_obj_new_int(frame.stbc);
    items[14] = mp_obj_new_int(frame.fec_coding);
    items[15] = mp_obj_new_int(frame.sgi);
    items[16] = mp_obj_new_int(frame.noise_floor);
    items[17] = mp_obj_new_int(frame.ampdu_cnt);
    items[18] = mp_obj_new_int(frame.secondary_channel);
    items[19] = mp_obj_new_int(frame.ant);
    items[20] = mp_obj_new_int(frame.sig_len);
    items[21] = mp_obj_new_int(frame.rx_state);

    return mp_obj_new_tuple(22, items);
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_read_obj, network_wlan_csi_read);

// wlan.csi_dropped() -> int
static mp_obj_t network_wlan_csi_dropped(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state
    return mp_obj_new_int(g_csi_state.buffer.dropped);
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_dropped_obj,
    network_wlan_csi_dropped);

// wlan.csi_available() -> int
static mp_obj_t network_wlan_csi_available(mp_obj_t self_in) {
    (void)self_in; // WLAN object not used, CSI is global state

    if (!g_csi_state.buffer.initialized) {
        return mp_obj_new_int(0);
    }

    uint32_t head = g_csi_state.buffer.head;
    uint32_t tail = g_csi_state.buffer.tail;
    uint32_t size = g_csi_state.buffer.size;

    uint32_t available = (head >= tail) ? (head - tail) : (size - tail + head);
    return mp_obj_new_int(available);
}
MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_csi_available_obj,
    network_wlan_csi_available);

#endif // MICROPY_PY_NETWORK_WLAN_CSI
